NextFOAM-2405/tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/cabin/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.03375;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00015;
        value           uniform 0.00015;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 0.00015;
    }

    cabin_to_ice
    {
        type            kqRWallFunction;
        value           uniform 0.00015;
    }
}


// ************************************************************************* //
